isundaylee/nRF5/apps/gateway/src/main.c
#include <stdio.h>

#include "app_error.h"
#include "nrf_delay.h"
#include "nrf_gpio.h"

#include "access_config.h"

#include "ble_softdevice_support.h"
#include "mesh_app_utils.h"
#include "mesh_stack.h"

#include "nrf_mesh_events.h"

#include "net_state.h"

#include "configurator.h"
#include "provisioner.h"

#include "protocol.h"
#include "protocol_config_client.h"

#include "composition_data.h"

#include "custom_log.h"
#include "rtt_input.h"

#include "app_timer.h"

#include "battery_level_client.h"
#include "battery_level_server.h"
#include "generic_onoff_client.h"
#include "health_client.h"

#include "app_button.h"

#include "app_uart.h"
#include "nrf_uart.h"

#include "debug_pins.h"

#define PIN_LED_ERROR 8
#define PIN_LED_INDICATION 6

#define APP_PIN_USER_BUTTON 7

#define APP_PIN_UART_TX 3
#define APP_PIN_UART_RX 2

APP_TIMER_DEF(onoff_client_toggle_timer);
APP_TIMER_DEF(self_config_timer);
APP_TIMER_DEF(pong_timer);

health_client_t health_client;

typedef struct {
  int addr;
} protocol_id_request_t;

typedef enum {
  PROTOCOL_ID_REQUEST = 0,

  PROTOCOL_NO_REQUEST = 100,
} protocol_request_type_t;

typedef struct {
  protocol_request_type_t type;
  union {
    protocol_id_request_t id_request;
  } request;
} protocol_request_t;

protocol_request_t pending_request = {.type = PROTOCOL_NO_REQUEST};

__attribute__((optimize(0))) void
app_error_fault_handler(uint32_t id, uint32_t pc, uint32_t info) {
  nrf_gpio_cfg_output(PIN_LED_ERROR);
  nrf_gpio_pin_clear(PIN_LED_ERROR);

  error_info_t *error_info = (error_info_t *)info;
  assert_info_t *assert_info = (assert_info_t *)info;

  switch (id) {
  case NRF_FAULT_ID_SDK_ERROR:
    LOG_ERROR("Encountered error %d on line %d in file %s",
              error_info->err_code, error_info->line_num,
              error_info->p_file_name);
    break;
  case NRF_FAULT_ID_SDK_ASSERT:
    LOG_ERROR("Encountered assertion error on line %d in file %s on pc 0x%x",
              assert_info->line_num, assert_info->p_file_name, pc);
    break;
  }

  NRF_BREAKPOINT_COND;
  while (1) {
  }
}

void mesh_assertion_handler(uint32_t pc) {
  assert_info_t assert_info = {.line_num = 0, .p_file_name = (uint8_t *)""};

  app_error_fault_handler(NRF_FAULT_ID_SDK_ASSERT, pc,
                          (uint32_t)(&assert_info));

  UNUSED_VARIABLE(assert_info);
}

static generic_onoff_client_t onoff_client;

static bool onoff_value = false;

void send_onoff_request(bool value) {
  static uint8_t tid = 0;
  generic_onoff_set_params_t params;

  params.tid = tid++;
  params.on_off = (value ? 1 : 0);

  onoff_value = value;

  APP_ERROR_CHECK(
      generic_onoff_client_set_unack(&onoff_client, &params, NULL, 2));
}

void button_handler(uint8_t pin_no, uint8_t button_action) {
  if (button_action == 0) {
    return;
  }

  switch (pin_no) {
  case APP_PIN_USER_BUTTON: //
  {
    LOG_INFO("User button pressed.");
    send_onoff_request(!onoff_value);
    break;
  }

  default: //
  {
    LOG_ERROR("Unknown button pressed.");
    break;
  }
  }
}

static void init_buttons() {
  // Initialize buttons
  static app_button_cfg_t buttons[] = {{
      .pin_no = APP_PIN_USER_BUTTON,
      .active_state = APP_BUTTON_ACTIVE_HIGH,
      .pull_cfg = NRF_GPIO_PIN_PULLDOWN,
      .button_handler = button_handler,
  }};

  APP_ERROR_CHECK(app_button_init(buttons, sizeof(buttons) / sizeof(buttons[0]),
                                  APP_TIMER_TICKS(50)));
  APP_ERROR_CHECK(app_button_enable());
}

static void pong_timer_handler(void *ctx) {
  protocol_reply(NRF_SUCCESS, "pong");
}

static void health_client_bind_step_builder(
    uint16_t addr, config_msg_composition_data_status_t const *composition_data,
    conf_step_t *steps_out) {
  conf_step_t *cursor = steps_out;

  if (pending_request.type == PROTOCOL_ID_REQUEST) {
    cursor->type = CONF_STEP_TYPE_MODEL_PUBLICATION_SET;
    cursor->params.model_publication_set.element_addr = addr;
    cursor->params.model_publication_set.model_id.company_id =
        ACCESS_COMPANY_ID_NONE;
    cursor->params.model_publication_set.model_id.model_id =
        HEALTH_CLIENT_MODEL_ID;
    cursor->params.model_publication_set.publish_address.type =
        NRF_MESH_ADDRESS_TYPE_UNICAST;
    cursor->params.model_publication_set.publish_address.value =
        pending_request.request.id_request.addr;
    cursor->params.model_publication_set.appkey_index = APP_APPKEY_IDX;
    cursor->params.model_publication_set.publish_ttl = 7;
    cursor->params.model_publication_set.publish_period.step_num = 0;
    cursor->params.model_publication_set.publish_period.step_res =
        ACCESS_PUBLISH_RESOLUTION_100MS;
    cursor++;
  } else {
    LOG_ERROR("Unexpected invocation of health_client_bind_step_builder.");
  }

  cursor->type = CONF_STEP_TYPE_DONE;
}

static void protocol_request_handler(char const *op, char const *params) {
  ASSERT(pending_request.type == PROTOCOL_NO_REQUEST);

  if (protocol_config_client_handle_request(op, params)) {
    return;
  }

  if (strcmp(op, "ping") == 0) {
    if (strlen(params) == 0) {
      protocol_reply(NRF_SUCCESS, "pong");
    } else {
      int delay_ms = atoi(params);
      uint32_t err =
          app_timer_start(pong_timer, APP_TIMER_TICKS(delay_ms), NULL);

      if (err != NRF_SUCCESS) {
        protocol_reply(err, "delayed ping failed");
      }
    }
  } else if (strcmp(op, "id") == 0) {
    uint32_t addr = strtol(params, NULL, 16);
    uint32_t err =
        conf_start(APP_GATEWAY_ADDR, health_client_bind_step_builder);

    if (err != NRF_SUCCESS) {
      protocol_reply(err, "health client config failed");
    } else {
      pending_request.type = PROTOCOL_ID_REQUEST;
      pending_request.request.id_request.addr = addr;
    }
  } else {
    protocol_reply(NRF_ERROR_NOT_FOUND, "invalid op '%s'", op);
  }
}

static void init_protocol() {
  APP_ERROR_CHECK(protocol_init(APP_PIN_UART_TX, APP_PIN_UART_RX,
                                protocol_request_handler));

  LOG_INFO("Protocol initialized.");
}

static void init_leds() {
  nrf_gpio_cfg_output(PIN_LED_ERROR);
  nrf_gpio_cfg_output(PIN_LED_INDICATION);
  nrf_gpio_pin_set(PIN_LED_ERROR);
  nrf_gpio_pin_set(PIN_LED_INDICATION);
}

static void init_logging() {
  __LOG_INIT(LOG_SRC_APP | LOG_SRC_BEARER | LOG_SRC_ACCESS, LOG_LEVEL_DBG1,
             log_callback_custom);
  LOG_INFO("Hello, world!");
}

static void rtt_input_handler(int key) {
  switch (key) {
  case '0':
    LOG_INFO("Turning it OFF!");
    send_onoff_request(false);
    break;

  case '1':
    LOG_INFO("Turning it ON!");
    send_onoff_request(true);
    break;
  }
}

