isundaylee/nRF5/apps/gateway/src/main.c
static void config_server_evt_cb(config_server_evt_t const *evt) {}

static void
generic_onoff_client_publish_interval_cb(access_model_handle_t handle,
                                         void *p_self) {
  // TODO:
}
static void
generic_onoff_client_status_cb(const generic_onoff_client_t *self,
                               const access_message_rx_meta_t *meta,
                               const generic_onoff_status_params_t *in) {
  LOG_INFO("OnOff server on 0x%04x is: %s.", meta->src.value,
           (in->present_on_off ? "ON" : "OFF"));

  nrf_mesh_rx_metadata_t const *core_metadata = meta->p_core_metadata;

  if (core_metadata->source != NRF_MESH_RX_SOURCE_SCANNER) {
    return;
  }

  nrf_mesh_rx_metadata_scanner_t const *scanner_metadata =
      &core_metadata->params.scanner;

  protocol_send("onoff %d %d %d %d", meta->src.value, meta->ttl,
                scanner_metadata->rssi, in->present_on_off);
}

static void
generic_onoff_client_transaction_status_cb(access_model_handle_t model_handle,
                                           void *p_args,
                                           access_reliable_status_t status) {
  // TODO:
}

char const *get_faults_description(health_client_evt_fault_status_t status) {
  if (status.fault_array_length == 0) {
    return "Healthy";
  } else if (status.fault_array_length == 1) {
    switch (status.p_fault_array[0]) {
    case APP_FAULT_ID_FRIENDLESS:
      return "Friendless";
    default:
      return "Unknown Fault";
    }
  } else {
    return "UNIMPLEMENTED YET";
  }
}

char const *to_hex(uint8_t const *data, size_t len) {
  static char buf[259];
  static char hex[17] = "0123456789abcdef";

  size_t actual_len = MIN(len, (sizeof(buf) - 1) / 2);

  buf[0] = '[';

  for (size_t i = 0; i < actual_len; i++) {
    buf[2 * i + 1] = hex[(data[i] & 0xF0) >> 4];
    buf[2 * i + 2] = hex[(data[i] & 0x0F) >> 0];
  }

  buf[2 * actual_len + 1] = ']';
  buf[2 * actual_len + 2] = '\0';

  return buf;
}

static void health_client_event_handler(health_client_t const *client,
                                        health_client_evt_t const *event) {
  switch (event->type) {
  case HEALTH_CLIENT_EVT_TYPE_CURRENT_STATUS_RECEIVED: //
  case HEALTH_CLIENT_EVT_TYPE_FAULT_STATUS_RECEIVED:   //
  {
    nrf_mesh_rx_metadata_t const *core_metadata =
        event->p_meta_data->p_core_metadata;

    if (core_metadata->source != NRF_MESH_RX_SOURCE_SCANNER) {
      break;
    }

    nrf_mesh_rx_metadata_scanner_t const *scanner_metadata =
        &core_metadata->params.scanner;

    protocol_send("health %d %d %d %s", event->p_meta_data->src.value,
                  event->p_meta_data->ttl, scanner_metadata->rssi,
                  to_hex(event->data.fault_status.p_fault_array,
                         event->data.fault_status.fault_array_length));

    break;
  }

  case HEALTH_CLIENT_EVT_TYPE_ATTENTION_STATUS_RECEIVED: //
  {
    if (pending_request.type != PROTOCOL_ID_REQUEST) {
      LOG_ERROR("Unexpected health client attention status received.");
      return;
    }

    protocol_reply(NRF_SUCCESS, "");
    pending_request.type = PROTOCOL_NO_REQUEST;

    break;
  }

  case HEALTH_CLIENT_EVT_TYPE_TIMEOUT: //
  {
    if (pending_request.type != PROTOCOL_ID_REQUEST) {
      LOG_ERROR("Unexpected health client timeout received.");
      return;
    }

    protocol_reply(NRF_ERROR_TIMEOUT, "timed out");
    pending_request.type = PROTOCOL_NO_REQUEST;

    break;
  }

  default: //
  {
    LOG_ERROR("Unexpected health client event type: %d", event->type);
    break;
  }
  }
}

void battery_level_client_status_handler(
    battery_level_client_t const *client, access_message_rx_meta_t const *meta,
    battery_level_status_params_t const *in) {
  nrf_mesh_rx_metadata_t const *core_metadata = meta->p_core_metadata;

  if (core_metadata->source != NRF_MESH_RX_SOURCE_SCANNER) {
    return;
  }

  nrf_mesh_rx_metadata_scanner_t const *scanner_metadata =
      &core_metadata->params.scanner;

  protocol_send("battery %d %d %d %d", meta->src.value, meta->ttl,
                scanner_metadata->rssi, in->level);
}

battery_level_client_t bl_client;

static void init_models(void) {
  APP_ERROR_CHECK(
      health_client_init(&health_client, 0, health_client_event_handler));
  LOG_INFO("Health client initialized.");

  static const generic_onoff_client_callbacks_t cbs = {
      .onoff_status_cb = generic_onoff_client_status_cb,
      .ack_transaction_status_cb = generic_onoff_client_transaction_status_cb,
      .periodic_publish_cb = generic_onoff_client_publish_interval_cb};

  onoff_client.settings.p_callbacks = &cbs;
  onoff_client.settings.timeout = 0;
  onoff_client.settings.force_segmented = false;
  onoff_client.settings.transmic_size = NRF_MESH_TRANSMIC_SIZE_SMALL;

  APP_ERROR_CHECK(generic_onoff_client_init(&onoff_client, 0));
  LOG_INFO("OnOff client initialized.");

  bl_client.settings.force_segmented = false;
  bl_client.settings.transmic_size = NRF_MESH_TRANSMIC_SIZE_SMALL;
  bl_client.settings.status_cb = battery_level_client_status_handler;

  APP_ERROR_CHECK(battery_level_client_init(&bl_client, 0));
  LOG_INFO("Battery Level client initialized.");
}

static void init_mesh() {
  // Initialize the softdevice
  ble_stack_init();
  LOG_INFO("Mesh soft device initialized.");

  // Initialize the Mesh stack
  nrf_clock_lf_cfg_t lfc_cfg = {.source = NRF_CLOCK_LF_SRC_XTAL,
                                .rc_ctiv = 0,
                                .rc_temp_ctiv = 0,
                                .accuracy = NRF_CLOCK_LF_ACCURACY_20_PPM};
  mesh_stack_init_params_t mesh_init_params = {
      .core.irq_priority = NRF_MESH_IRQ_PRIORITY_LOWEST,
      .core.lfclksrc = lfc_cfg,
      .models.config_server_cb = config_server_evt_cb,
      .models.models_init_cb = init_models};
  bool provisioned;
  APP_ERROR_CHECK(mesh_stack_init(&mesh_init_params, &provisioned));

  LOG_INFO("Mesh stack initialized.");

  // Print out the device MAC address
  ble_gap_addr_t addr;
  APP_ERROR_CHECK(sd_ble_gap_addr_get(&addr));

  LOG_INFO("Device address is %2x:%2x:%2x:%2x:%2x:%2x", addr.addr[0],
           addr.addr[1], addr.addr[2], addr.addr[3], addr.addr[4],
           addr.addr[5]);
}

static void prov_start_cb(uint16_t addr) {
  nrf_gpio_pin_clear(PIN_LED_INDICATION);
}

static void
conf_step_builder(uint16_t addr,
                  config_msg_composition_data_status_t const *composition_data,
                  conf_step_t *steps_out) {
  conf_step_t *cursor = steps_out;
  uint8_t const *data = composition_data->data;

  cursor->type = CONF_STEP_TYPE_APPKEY_ADD;
  cursor->params.appkey_add.netkey_index = APP_NETKEY_IDX;
  cursor->params.appkey_add.appkey_index = APP_APPKEY_IDX;
  cursor->params.appkey_add.appkey = app_state.persistent.network.appkey;
  cursor++;

  // TODO: Assuming 1 element
  config_composition_element_header_t const *element_header =
      (config_composition_element_header_t const
           *)&data[sizeof(config_composition_data_header_t)];
  LOG_INFO("SIG model number: %d. Vendor model number: %d.",
           element_header->sig_model_count, element_header->vendor_model_count);

  uint16_t const *sig_model_ids =
      (uint16_t const *)(&data[sizeof(config_composition_data_header_t) +
                               sizeof(config_composition_element_header_t)]);
  for (uint8_t i = 0; i < element_header->sig_model_count; i++) {
    uint16_t sig_model_id = sig_model_ids[i];

    switch (sig_model_id) {
    case HEALTH_SERVER_MODEL_ID: //
    {
      LOG_INFO("Adding steps for Health Server...");

