isundaylee/nRF5/apps/gateway/src/main.c
      cursor->type = CONF_STEP_TYPE_MODEL_APP_BIND;
      cursor->params.model_app_bind.element_addr = addr;
      cursor->params.model_app_bind.model_id.company_id =
          ACCESS_COMPANY_ID_NONE;
      cursor->params.model_app_bind.model_id.model_id = HEALTH_SERVER_MODEL_ID;
      cursor->params.model_app_bind.appkey_index = APP_APPKEY_IDX;
      cursor++;

      cursor->type = CONF_STEP_TYPE_MODEL_PUBLICATION_SET;
      cursor->params.model_publication_set.element_addr = addr;
      cursor->params.model_publication_set.model_id.company_id =
          ACCESS_COMPANY_ID_NONE;
      cursor->params.model_publication_set.model_id.model_id =
          HEALTH_SERVER_MODEL_ID;
      cursor->params.model_publication_set.publish_address.type =
          NRF_MESH_ADDRESS_TYPE_UNICAST;
      cursor->params.model_publication_set.publish_address.value = 0x0001;
      cursor->params.model_publication_set.appkey_index = APP_APPKEY_IDX;
      cursor->params.model_publication_set.publish_ttl = 7;
      cursor->params.model_publication_set.publish_period.step_num = 10;
      cursor->params.model_publication_set.publish_period.step_res =
          ACCESS_PUBLISH_RESOLUTION_1S;
      cursor++;

      break;
    }

    case HEALTH_CLIENT_MODEL_ID: //
    {
      LOG_INFO("Adding steps for Health Client...");

      cursor->type = CONF_STEP_TYPE_MODEL_APP_BIND;
      cursor->params.model_app_bind.element_addr = APP_GATEWAY_ADDR;
      cursor->params.model_app_bind.model_id.company_id =
          ACCESS_COMPANY_ID_NONE;
      cursor->params.model_app_bind.model_id.model_id = HEALTH_CLIENT_MODEL_ID;
      cursor->params.model_app_bind.appkey_index = APP_APPKEY_IDX;
      cursor++;

      break;
    }

    case 0x1000: // Generic OnOff Server
    {
      LOG_INFO("Adding steps for Generic OnOff Server...");

      cursor->type = CONF_STEP_TYPE_MODEL_APP_BIND;
      cursor->params.model_app_bind.element_addr = addr;
      cursor->params.model_app_bind.model_id.company_id =
          ACCESS_COMPANY_ID_NONE;
      cursor->params.model_app_bind.model_id.model_id =
          0x1000, // Generic OnOff Server
          cursor->params.model_app_bind.appkey_index = APP_APPKEY_IDX;
      cursor++;

      cursor->type = CONF_STEP_TYPE_MODEL_PUBLICATION_SET;
      cursor->params.model_publication_set.element_addr = addr;
      cursor->params.model_publication_set.model_id.company_id =
          ACCESS_COMPANY_ID_NONE;
      cursor->params.model_publication_set.model_id.model_id =
          0x1000; // Generic OnOff Server
      cursor->params.model_publication_set.publish_address.type =
          NRF_MESH_ADDRESS_TYPE_UNICAST;
      cursor->params.model_publication_set.publish_address.value =
          APP_GATEWAY_ADDR;
      cursor->params.model_publication_set.appkey_index = APP_APPKEY_IDX;
      cursor->params.model_publication_set.publish_ttl = 7;
      cursor->params.model_publication_set.publish_period.step_num = 0;
      cursor->params.model_publication_set.publish_period.step_res =
          ACCESS_PUBLISH_RESOLUTION_100MS;
      cursor++;

      cursor->type = CONF_STEP_TYPE_MODEL_SUBSCRIPTION_ADD;
      cursor->params.model_subscription_add.element_addr = addr;
      cursor->params.model_subscription_add.model_id.company_id =
          ACCESS_COMPANY_ID_NONE;
      cursor->params.model_subscription_add.model_id.model_id =
          0x1000; // Generic OnOff Server
      cursor->params.model_subscription_add.address.type =
          NRF_MESH_ADDRESS_TYPE_GROUP;
      cursor->params.model_subscription_add.address.value = APP_PROXIMITY_ADDR;
      cursor++;

      break;
    }

    case GENERIC_ONOFF_CLIENT_MODEL_ID: //
    {
      LOG_INFO("Adding steps for Generic OnOff Client...");

      cursor->type = CONF_STEP_TYPE_MODEL_APP_BIND;
      cursor->params.model_app_bind.element_addr = addr;
      cursor->params.model_app_bind.model_id.company_id =
          ACCESS_COMPANY_ID_NONE;
      cursor->params.model_app_bind.model_id.model_id =
          GENERIC_ONOFF_CLIENT_MODEL_ID;
      cursor->params.model_app_bind.appkey_index = APP_APPKEY_IDX;
      cursor++;

      cursor->type = CONF_STEP_TYPE_MODEL_PUBLICATION_SET;
      cursor->params.model_publication_set.element_addr = addr;
      cursor->params.model_publication_set.model_id.company_id =
          ACCESS_COMPANY_ID_NONE;
      cursor->params.model_publication_set.model_id.model_id =
          GENERIC_ONOFF_CLIENT_MODEL_ID;
      cursor->params.model_publication_set.publish_address.type =
          NRF_MESH_ADDRESS_TYPE_GROUP;
      cursor->params.model_publication_set.publish_address.value = APP_LED_ADDR;
      cursor->params.model_publication_set.appkey_index = APP_APPKEY_IDX;
      cursor->params.model_publication_set.publish_ttl = 7;
      cursor->params.model_publication_set.publish_period.step_num = 0;
      cursor->params.model_publication_set.publish_period.step_res =
          ACCESS_PUBLISH_RESOLUTION_100MS;
      cursor++;

      break;
    }

    default: //
    {
      LOG_INFO("Unknown SIG model: %d.", sig_model_id);
      break;
    }
    }
  }

  uint32_t const *vendor_model_ids =
      (uint32_t const
           *)(&data[sizeof(config_composition_data_header_t) +
                    sizeof(config_composition_element_header_t) +
                    element_header->sig_model_count * sizeof(uint16_t)]);
  for (size_t i = 0; i < element_header->vendor_model_count; i++) {
    uint32_t vendor_model_id = vendor_model_ids[i];

    if (vendor_model_id == 0x0001BEEE) {
      LOG_INFO("Adding steps for Battery Level Server...");

      cursor->type = CONF_STEP_TYPE_MODEL_APP_BIND;
      cursor->params.model_app_bind.element_addr = addr;
      cursor->params.model_app_bind.model_id.company_id =
          BATTERY_LEVEL_COMPANY_ID;
      cursor->params.model_app_bind.model_id.model_id =
          BATTERY_LEVEL_SERVER_MODEL_ID;
      cursor->params.model_app_bind.appkey_index = APP_APPKEY_IDX;
      cursor++;

      cursor->type = CONF_STEP_TYPE_MODEL_PUBLICATION_SET;
      cursor->params.model_publication_set.element_addr = addr;
      cursor->params.model_publication_set.model_id.company_id =
          BATTERY_LEVEL_COMPANY_ID;
      cursor->params.model_publication_set.model_id.model_id =
          BATTERY_LEVEL_SERVER_MODEL_ID;
      cursor->params.model_publication_set.publish_address.type =
          NRF_MESH_ADDRESS_TYPE_UNICAST;
      cursor->params.model_publication_set.publish_address.value = 0x0001;
      cursor->params.model_publication_set.appkey_index = APP_APPKEY_IDX;
      cursor->params.model_publication_set.publish_ttl = 7;
      cursor->params.model_publication_set.publish_period.step_num = 10;
      cursor->params.model_publication_set.publish_period.step_res =
          ACCESS_PUBLISH_RESOLUTION_1S;
      cursor++;
    } else if (vendor_model_id == 0x0002BEEE) {
      LOG_INFO("Adding steps for Battery Level Client...");

