isundaylee/nRF5/apps/gateway/src/main.c
      cursor->type = CONF_STEP_TYPE_MODEL_APP_BIND;
      cursor->params.model_app_bind.element_addr = APP_GATEWAY_ADDR;
      cursor->params.model_app_bind.model_id.company_id =
          BATTERY_LEVEL_COMPANY_ID;
      cursor->params.model_app_bind.model_id.model_id =
          BATTERY_LEVEL_CLIENT_MODEL_ID;
      cursor->params.model_app_bind.appkey_index = APP_APPKEY_IDX;
      cursor++;
    } else {
      LOG_ERROR("Unknown vendor model: 0x%08x.", vendor_model_id);
    }
  }

  cursor->type = CONF_STEP_TYPE_DONE;
}

static void prov_success_cb(uint16_t addr) {
  nrf_gpio_pin_set(PIN_LED_INDICATION);

  APP_ERROR_CHECK(conf_start(addr, conf_step_builder));
}

static void prov_failure_cb() {
  nrf_gpio_pin_set(PIN_LED_INDICATION);

  prov_start_scan();
}

static void conf_success_cb(uint16_t addr) {
  if (protocol_config_client_handle_conf_success(addr)) {
    return;
  }

  switch (pending_request.type) {
  case PROTOCOL_ID_REQUEST: //
  {
    uint32_t err = health_client_attention_set(&health_client, 10, true);

    if (err != NRF_SUCCESS) {
      protocol_reply(err, "failed to set attention timer");
      pending_request.type = PROTOCOL_NO_REQUEST;
      return;
    }

    return;
  }

  case PROTOCOL_NO_REQUEST:
  default:
    break;
  }

  prov_start_scan();
}

static void conf_failure_cb(uint16_t addr, uint32_t err) {
  if (protocol_config_client_handle_conf_failure(addr, err)) {
    return;
  }

  switch (pending_request.type) {
  case PROTOCOL_ID_REQUEST: //
  {
    protocol_reply(err, "failed to config health client");
    pending_request.type = PROTOCOL_NO_REQUEST;
    return;
  }

  case PROTOCOL_NO_REQUEST:
  default:
    break;
  }

  prov_start_scan();
}

static void onoff_client_toggle_timer_handler(void *context) {
  static bool value = false;

  send_onoff_request(value);
  value = !value;
}

static void self_config_timer_handler(void *context) {
  LOG_INFO("Starting self-configuration...");

  conf_start(APP_GATEWAY_ADDR, conf_step_builder);
}

static void start() {
  APP_ERROR_CHECK(protocol_start());
  LOG_INFO("Protocol started.");

  rtt_input_enable(rtt_input_handler, 100);

  APP_ERROR_CHECK(mesh_stack_start());
  LOG_INFO("Mesh stack started.");

  app_state_init();

  bool is_provisioned = mesh_stack_is_device_provisioned();

  if (is_provisioned) {
    LOG_ERROR("We have already been provisioned. ");

    nrf_gpio_cfg_input(8, NRF_GPIO_PIN_PULLDOWN);
    // bool should_reset = (nrf_gpio_pin_read(8) != 0);
    bool should_reset = false;

    if (should_reset) {
      LOG_ERROR("Will clear all config and reset in 1s. ");

      mesh_stack_config_clear();
      nrf_delay_ms(1000);
      mesh_stack_device_reset();
      while (1) {
      }
    } else {
      LOG_ERROR("Will reuse the existing network config. ");
      app_state_load();
    }
  } else {
    app_state_clear();
  }

  prov_init(&app_state, prov_start_cb, prov_success_cb, prov_failure_cb);
  conf_init(&app_state, conf_success_cb, conf_failure_cb);

  APP_ERROR_CHECK(protocol_config_client_init());

  APP_ERROR_CHECK(app_timer_create(&onoff_client_toggle_timer,
                                   APP_TIMER_MODE_REPEATED,
                                   onoff_client_toggle_timer_handler));
  APP_ERROR_CHECK(app_timer_create(&self_config_timer,
                                   APP_TIMER_MODE_SINGLE_SHOT,
                                   self_config_timer_handler));
  APP_ERROR_CHECK(app_timer_create(&pong_timer, APP_TIMER_MODE_SINGLE_SHOT,
                                   pong_timer_handler));

  if (!is_provisioned) {
    APP_ERROR_CHECK(
        app_timer_start(self_config_timer, APP_TIMER_TICKS(1000), NULL));
  } else {
    prov_start_scan();
  }
}

void init_regout() {
#ifdef NRF52840_XXAA
  if ((NRF_UICR->REGOUT0 & UICR_REGOUT0_VOUT_Msk) ==
      (UICR_REGOUT0_VOUT_DEFAULT << UICR_REGOUT0_VOUT_Pos)) {
    NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Wen;
    while (NRF_NVMC->READY == NVMC_READY_READY_Busy) {
    }

    NRF_UICR->REGOUT0 =
        (NRF_UICR->REGOUT0 & ~((uint32_t)UICR_REGOUT0_VOUT_Msk)) |
        (UICR_REGOUT0_VOUT_3V0 << UICR_REGOUT0_VOUT_Pos);

    NRF_NVMC->CONFIG = NVMC_CONFIG_WEN_Ren;
    while (NRF_NVMC->READY == NVMC_READY_READY_Busy) {
    }

    // System reset is needed to update UICR registers.
    NVIC_SystemReset();
  }
#endif
}

int main(void) {
  DEBUG_PINS_INIT();

  init_regout();
  init_logging();
  init_protocol();
  init_leds();
  init_mesh();
  init_buttons();

  start();

  while (true) {
    (void)sd_app_evt_wait();
  }
}
